[
  {
    "id": "board1",
    "name": "Kanban Board Tutorial",
    "taskList": [
      {
        "id": "1",
        "title": "This is a sample task. If you click on it, you can see more details and even update it!",
        "description": "Here you have a detailed description of the task. If you click on the Edit button below you can update all the information about the task. Go ahead and change the title of this task to 'finish the tutorial'. Then you can drag and drop this task to the 'In Progress' column.",
        "assignee": "Here you can assign the task to someone. It's optional, but it helps to know who is responsible for the task.",
        "status": "To Do",
        "priority": "You can also set a priority for the task (e.g., High, Medium, Low)",
        "createdDate": "2023-09-15",
        "dueDate": "You can even set a due date for the task, like 2023-10-01",
        "isArchived": false
      },
      {
        "id": "2",
        "title": "Move this task to the 'Done' column and see how the status changes.",
        "description": "The status of the task will automatically update when you move it to a different column. Click on it to see the details. You can also change the status manually by editing the task if needed.",
        "assignee": "You",
        "status": "In Progress",
        "priority": "Low",
        "createdDate": "2023-09-16",
        "dueDate": "2023-10-10",
        "isArchived": false
      },
      {
        "id": "3",
        "title": "Delete this task to see how it disappears from the board.",
        "description": "The trash icon allows you to delete the task. Once deleted, it will no longer appear on the board. Be careful when deleting tasks!",
        "assignee": "You",
        "status": "To do",
        "priority": "High",
        "createdDate": "2023-09-17",
        "dueDate": "",
        "isArchived": false
      },
      {
        "id": "4",
        "title": "Create a new task by clicking the 'Add Task' button at the end of the 'To Do' column.",
        "description": "You can add as many tasks as you need. Each task can have its own title, details, assignee, status, priority and due date.",
        "assignee": "You",
        "status": "To Do",
        "priority": "Medium",
        "createdDate": "2023-09-18",
        "dueDate": "2023-10-05",
        "isArchived": false
      },
      {
        "id": "5",
        "title": "Archive the Example Board in the My Boards section to see how it moves to the 'Archived Boards' section.",
        "description": "First, go to the My boards section by clicking at 'My Boards' in the sidebar or through the 'Home' tab. Move the Example board to the Archived boards by clicking on the archive button. Archived boards are not deleted but moved to a separate section. You can view all archived boards anytime clicking on the 'Archived Boards' title in the sidebar.",
        "assignee": "You",
        "status": "Done",
        "priority": "Low",
        "createdDate": "2023-09-19",
        "dueDate": "",
        "isArchived": false
      },
      {
        "id": "6",
        "title": "Take the Example Board back from the archive and see how it moves to the 'My Boards' section.",
        "description": "Tasks from archived Boards can not be deleted, edited or moved to other columns. To do so you have to return the board to the My Boards section by clicking on the 'Unarchive' button.",
        "assignee": "You",
        "status": "Done",
        "priority": "Low",
        "createdDate": "2023-09-19",
        "dueDate": "",
        "isArchived": false
      },
      {
        "id": "9",
        "title": "Archive again the Example board and delete it",
        "description": "You can only delete a board from the 'Archived Boards' section. To do so, when in the archived boards section, click on the board and then click on the 'Delete Board' button. This action is irreversible, but don't worry, a prompt will appear to let you confirm wether you really want to delete the board before proceeding.",
        "assignee": "You",
        "status": "To Do",
        "priority": "Low",
        "createdDate": "2023-09-19",
        "dueDate": "",
        "isArchived": false
      },
      {
        "id": "10",
        "title": "Create your first board",
        "description": "To create a new board, click on the 'Create Board' button in the sidebar. You can name your board and start adding tasks to it. Each board can have its own set of tasks, and you can switch between boards easily through the sidebar. This allows you to organize your tasks by different projects or categories.",
        "assignee": "You",
        "status": "To Do",
        "priority": "Low",
        "createdDate": "2023-09-19",
        "dueDate": "",
        "isArchived": false
      },
      {
        "id": "11",
        "title": "Final task: Archive this board through the sidebar",
        "description": "To conclude the tutorial, you can archive this board by dragging it from the My Boards section on the sidebar to the Archived Boards section. This is an easier way to move the boards between sections.",
        "assignee": "You",
        "status": "To Do",
        "priority": "Low",
        "createdDate": "2023-09-19",
        "dueDate": "",
        "isArchived": false
      }
    ],
    "isArchived": false
  },
  {
    "id": "board2",
    "name": "Example Board",
    "taskList": [
      {
        "id": "1",
        "title": "Archive this board",
        "description": "Once archived, the board remains in 'Read-only' state, so that tasks can't be dragged between lists, and they can neither be edited or deleted ",
        "assignee": "Mary Davis",
        "status": "To Do",
        "priority": "High",
        "createdDate": "2023-09-15",
        "dueDate": "",
        "isArchived": false
      },
      {
        "id": "2",
        "title": "Delete this board once and for all",
        "description": "Don't hesitate and delete this whole board already! You just need to click on the trash icon on the board card in Archived Boards general view",
        "assignee": "Mary Davis",
        "status": "To Do",
        "priority": "High",
        "createdDate": "2023-09-15",
        "dueDate": "",
        "isArchived": false
      }
    ],
    "isArchived": false
  }
]
